Repository: yangmt0409/StudySync
Catalog: StudySync/Localizable.xcstrings
Source language: zh_hans
Languages: en, ja, ko, zh_hant

source: 活动已结束
en: Event ended
ja: イベント終了
ko: 이벤트 종료됨
zh_hant: 活動已結束

source: 活跃房间
en: Active Rooms
ja: アクティブルーム
ko: 활성 룸
zh_hant: 活躍房間

source: 测试员
en: Tester
ja: テスター
ko: 테스터
zh_hant: 測試員

source: 海洋蓝
en: Ocean Blue
ja: オーシャンブルー
ko: 오션 블루
zh_hant: 海洋藍

source: 深链接
en: Deep link
ja: ディープリンク
ko: 딥링크
zh_hant: 深連結

# 添加「%@」倒计时，%lld 天后
source: 添加「%1$@」倒计时，%2$lld 天后
en: Add "%1$@" countdown, %2$lld days from now
ja: 「%1$@」カウントダウンを%2$lld日後に追加
ko: 「%1$@」 카운트다운을 %2$lld일 후로 추가
zh_hant: 新增「%1$@」倒數，%2$lld 天後

source: 添加「${title}」倒计时，${daysFromNow} 天后
en: Add "${title}" countdown, ${daysFromNow} days from now
ja: 「${title}」カウントダウン追加、${daysFromNow}日後
ko: 「${title}」 카운트다운 추가, ${daysFromNow}일 후
zh_hant: 新增「${title}」倒數，${daysFromNow} 天後

source: 添加事件
en: Add Event
ja: イベントを追加
ko: 이벤트 추가

source: 添加任务
en: Add Task
ja: タスクを追加
ko: 태스크 추가
zh_hant: 新增任務

source: 添加你的第一个倒计时 追踪学期、签证、回国等重要日期
en: Add your first countdown Track semesters, visas, trips and more
ja: 最初のカウントダウンを追加 学期、ビザ、帰国など重要な日付を追跡
ko: 첫 카운트다운을 추가하세요 학기, 비자, 귀국 등 중요한 날짜를 추적해요
zh_hant: 添加你的第一個倒數 追蹤學期、簽證、回國等重要日期

source: 添加你的第一个待办，开始高效管理任务
en: Add your first todo and start managing tasks efficiently
ja: 最初のToDoを追加して、効率的なタスク管理を始めましょう
ko: 첫 할 일을 추가하고 효율적인 태스크 관리를 시작하세요
zh_hant: 新增你的第一個待辦，開始高效管理任務

source: 添加倒计时
en: Add Countdown
ja: カウントダウンを追加
ko: 카운트다운 추가
zh_hant: 新增倒數

source: 添加备注...
en: Add notes...
ja: メモを追加...
ko: 메모 추가...
zh_hant: 新增備註...

source: 添加备注（可选）
en: Add a note (optional)
ja: メモを追加(オプション)
ko: 메모 추가 (선택)
zh_hant: 新增備註（可選）

source: 添加好友
en: Add Friend
ja: 友達を追加
ko: 친구 추가
zh_hant: 新增好友

source: 添加好友后可以查看彼此的 Due 进度和学习成就
en: Add friends to view each other's due progress and achievements
ja: 友達を追加すると、お互いのDue進捗や学習成果を見ることができます
ko: 친구를 추가하면 서로의 Due 진행상황과 학습 성취를 볼 수 있어요
zh_hant: 新增好友後可以查看彼此的 Due 進度和學習成就

source: 添加待办
en: Add Todo
ja: ToDoを追加
ko: 할 일 추가
zh_hant: 新增待辦

source: 添加提醒
en: Add Reminder
ja: リマインダーを追加
ko: 알림 추가
zh_hant: 新增提醒

source: 添加日历事件
en: Add Calendar Event
ja: カレンダーイベントを追加
ko: 캘린더 이벤트 추가
zh_hant: 新增日曆事件

source: 添加生日（可选）
en: Add birthday (optional)
ja: 誕生日を追加(オプション)
ko: 생일 추가 (선택)
zh_hant: 新增生日（可選）

source: 添加目标
en: Add Goal
ja: 目標を追加
ko: 목표 추가
zh_hant: 新增目標

source: 添加第一个好友
en: Add your first friend
ja: 最初の友達を追加
ko: 첫 친구 추가
zh_hant: 新增第一個好友

source: 添加行程
en: Add Trip
ja: 行程を追加
ko: 여행 추가
zh_hant: 新增行程

source: 添加课程
en: Add Course
ja: 科目を追加
ko: 과목 추가
zh_hant: 新增課程

source: 添加课程，录入成绩 计算达标所需分数
en: Add courses, enter scores and calculate what you need
ja: 科目を追加し、点数を入力して 目標達成に必要なスコアを計算
ko: 과목을 추가하고 점수를 입력해서 목표 달성에 필요한 점수를 계산하세요
zh_hant: 新增課程，錄入成績 計算達標所需分數

source: 添加账户
en: Add Account
ja: アカウントを追加
ko: 계정 추가
zh_hant: 新增帳戶

source: 添加项目
en: Add Component
ja: 項目を追加
ko: 항목 추가
zh_hant: 新增項目

source: 清除已完成
en: Clear Completed
ja: 完了済みを消去
ko: 완료됨 지우기

source: 清除已完成待办
en: Clear Completed
ja: 完了したToDoを消去
ko: 완료된 할 일 지우기
zh_hant: 清除已完成待辦

source: 火车
en: Train
ja: 列車
ko: 열차
zh_hant: 火車

source: 点击 + 创建第一个任务
en: Tap + to create your first task
ja: +をタップして最初のタスクを作成
ko: + 를 눌러 첫 태스크 만들기
zh_hant: 點擊 + 建立第一個任務

source: 点击右上角 ⋯ 菜单
en: Tap the ⋯ menu in the top-right
ja: 右上の ⋯ メニューをタップ
ko: 우측 상단의 ⋯ 메뉴를 누름
zh_hant: 點擊右上角 ⋯ 選單

source: 点击查看用量详情
en: Tap to view usage details
ja: タップで使用量の詳細を表示
ko: 탭하여 사용량 상세 보기
zh_hant: 點擊查看用量詳情

source: 点的形状
en: Dot Shape
ja: ドット形状
ko: 도트 모양
zh_hant: 點的形狀

source: 点阵
en: Dot Grid
ja: ドットグリッド
ko: 도트 그리드
zh_hant: 點陣

source: 点阵风
en: Dot Grid
ja: ドットグリッド
ko: 도트 그리드
zh_hant: 點陣風

source: 爱心
en: Heart
ja: ハート
ko: 하트
zh_hant: 愛心

source: 版本
en: Version
ja: バージョン
ko: 버전

source: 状态刷新于 %@
en: Status refreshed %@
ja: ステータス更新: %@
ko: 상태 새로고침 %@
zh_hant: 狀態重新整理於 %@

source: 珊瑚粉
en: Coral Pink
ja: コーラルピンク
ko: 코랄 핑크

source: 生成分享卡片
en: Generate Share Card
ja: 共有カードを生成
ko: 공유 카드 생성

source: 生日快乐，%@！
en: Happy Birthday, %@!
ja: お誕生日おめでとうございます、%@さん!
ko: 생일 축하해요, %@!
zh_hant: 生日快樂，%@！

source: 生活
en: Life
ja: ライフ
ko: 생활

source: 用量已刷新
en: Usage Refreshed
ja: 使用量を更新しました
ko: 사용량 새로고침됨
zh_hant: 用量已重新整理

source: 用量已超过阈值
en: Usage exceeded threshold
ja: 使用量がしきい値を超えました
ko: 사용량이 임계값을 초과했어요
zh_hant: 用量已超過閾值

source: 用量提醒阈值
en: Usage Alert Threshold
ja: 使用量アラートのしきい値
ko: 사용량 알림 임계값
zh_hant: 用量提醒閾值

source: 用量数据解析失败
en: Failed to parse usage data
ja: 使用量データの解析に失敗しました
ko: 사용량 데이터 파싱 실패
zh_hant: 用量資料解析失敗

source: 用量详情
en: Usage Details
ja: 使用量詳細
ko: 사용량 상세
zh_hant: 用量詳情

source: 用量趋势
en: Usage Trend
ja: 使用量トレンド
ko: 사용량 추세
zh_hant: 用量趨勢

source: 用量页面
en: Usage Page
ja: 使用量ページ
ko: 사용량 페이지
zh_hant: 用量頁面

source: 用量高
en: High Usage
ja: 使用量が多い
ko: 높은 사용량

source: 留学地
en: Study
ja: 留学先
ko: 유학지
zh_hant: 留學地

source: 留学城市
en: Study City
ja: 留学都市
ko: 유학 도시
zh_hant: 留學城市

source: 留学生时间追踪
en: Time tracker for students abroad
ja: 留学生のための時間トラッカー
ko: 유학생을 위한 시간 추적
zh_hant: 留學生時間追蹤

source: 留时
en: StudySync
ja: StudySync
ko: StudySync
zh_hant: 留時

source: 留时提醒
en: StudySync Reminder
ja: StudySyncリマインダー
ko: StudySync 알림
zh_hant: 留時提醒

source: 登出后本设备将停止从云端同步新的数据，社交、团队、通知功能也会暂停。已下载到本地的倒计时和学习目标会保留，重新登录即可继续同步。
en: After signing out, this device will stop syncing new data from the cloud. Social, team, and notification features will also be paused. Countdowns and study goals already saved locally will be kept. Sign back in to resume syncing.
ja: サインアウトすると、このデバイスはクラウド同期を停止します。ソーシャル、チーム、通知機能も一時停止されます。ローカルに保存されたカウントダウンと学習目標は保持され、再度サインインすれば同期を再開できます。
ko: 로그아웃하면 이 기기는 클라우드 동기화가 중단돼요. 소셜, 팀, 알림 기능도 일시 중지돼요. 로컬에 저장된 카운트다운과 학습 목표는 유지되며 다시 로그인하면 동기화를 재개할 수 있어요.
zh_hant: 登出後本設備將停止從雲端同步新的資料，社交、團隊、通知功能也會暫停。已下載到本地的倒數計時和學習目標會保留，重新登入即可繼續同步。

source: 登录
en: Sign In
ja: サインイン
ko: 로그인
zh_hant: 登入

source: 登录 %@
en: Sign in to %@
ja: %@にサインイン
ko: %@에 로그인
zh_hant: 登入 %@

source: 登录后可以添加好友、查看彼此的 Due 进度
en: Sign in to add friends and track each other's due progress
ja: サインインすると、友達を追加してお互いのDue進捗を確認できます
ko: 로그인하면 친구를 추가하고 서로의 Due 진행상황을 볼 수 있어요
zh_hant: 登入後可以新增好友、查看彼此的 Due 進度

source: 登录失败，请重试
en: Sign in failed, please try again
ja: サインインに失敗しました。再試行してください
ko: 로그인 실패, 다시 시도해주세요
zh_hant: 登入失敗，請重試

source: 登录已过期，请重新登录。
en: Session expired. Please sign in again.
ja: セッションの有効期限が切れました。再度サインインしてください。
ko: 세션이 만료됐어요. 다시 로그인해주세요.
zh_hant: 登入已過期，請重新登入。

source: 登录已过期，请重新登录以继续获取用量数据。
en: Session expired. Please re-login to continue tracking usage.
ja: セッションの有効期限が切れました。使用量データを継続するには再度サインインしてください。
ko: 세션이 만료됐어요. 사용량 데이터를 계속 추적하려면 다시 로그인해주세요.
zh_hant: 登入已過期，請重新登入以繼續獲取用量資料。

source: 登录账号后，你的所有数据会通过云端账号自动在各设备间同步，重装 App 也能一键恢复。iCloud 为可选的本地备份通道，更改此设置需要重启 App。
en: After signing in, all your data will sync automatically across devices via your cloud account. Reinstalling the app restores everything with one tap. iCloud is an optional local backup channel — changing this setting requires restarting the app.
ja: サインインすると、すべてのデータがクラウドアカウント経由でデバイス間で自動同期されます。アプリを再インストールしてもワンタップで復元可能。iCloudはオプションのローカルバックアップです。この設定変更にはアプリの再起動が必要です。
ko: 로그인하면 모든 데이터가 클라우드 계정을 통해 기기 간 자동 동기화돼요. 앱을 다시 설치해도 한 번에 복구할 수 있어요. iCloud는 선택적 로컬 백업 채널이며, 이 설정 변경은 앱 재시작이 필요해요.
zh_hant: 登入帳號後，你的所有資料會透過雲端帳號自動在各設備間同步，重裝 App 也能一鍵恢復。iCloud 為可選的本地備份通道，更改此設定需要重新啟動 App。

source: 登机中
en: Boarding
ja: 搭乗中
ko: 탑승 중
zh_hant: 登機中

source: 百分比
en: Percentage
ja: パーセント
ko: 백분율

source: 百日之约
en: 100-Day Promise
ja: 100日の約束
ko: 100일의 약속
zh_hant: 百日之約

source: 百日王者
en: 100-Day Champion
ja: 100日チャンピオン
ko: 100일 챔피언

source: 百次成就
en: Century Mark
ja: 100回達成
ko: 100회 달성

source: 目前没有进行中的倒计时事件
en: No active countdown events
ja: 進行中のカウントダウンイベントはありません
ko: 진행 중인 카운트다운 이벤트가 없어요
zh_hant: 目前沒有進行中的倒數事件

source: 目标
en: Target
ja: 目標
ko: 목표
zh_hant: 目標

source: 目标可能无法达到
en: Target may not be achievable
ja: 目標達成が難しい可能性があります
ko: 목표 달성이 어려울 수 있어요
zh_hant: 目標可能無法達到

source: 目标可达
en: Target Achievable
ja: 目標達成可能
ko: 목표 달성 가능
zh_hant: 目標可達

source: 目标名称
en: Goal Name
ja: 目標名
ko: 목표 이름
zh_hant: 目標名稱

source: 目标已归档
en: Goal archived
ja: 目標をアーカイブしました
ko: 목표가 아카이브됐어요
zh_hant: 目標已歸檔

source: 目标成绩
en: Target Grade
ja: 目標成績
ko: 목표 성적
zh_hant: 目標成績

source: 目标日期
en: Target Date
ja: 目標日
ko: 목표일
zh_hant: 目標日期

source: 目标日期不能早于开始日期
en: Target date cannot be before start date
ja: 目標日は開始日より前にはできません
ko: 목표일은 시작일보다 이를 수 없어요
zh_hant: 目標日期不能早於開始日期

source: 目标满员
en: Goal Setter
ja: 目標セッター
ko: 목표 설정자
zh_hant: 目標滿員

source: 目标连续打卡
en: Streak Goal
ja: 目標ストリーク
ko: 목표 연속 체크인
zh_hant: 目標連續打卡

source: 直达
en: Direct
ja: 直行
ko: 직행
zh_hant: 直達

source: 相机权限已被拒绝，请在设置中开启
en: Camera access was denied. Please enable it in Settings.
ja: カメラへのアクセスが拒否されました。設定で有効にしてください。
ko: 카메라 권한이 거부됐어요. 설정에서 활성화해주세요.
zh_hant: 相機權限已被拒絕，請在設定中開啟

source: 短休息
en: Short Break
ja: 短い休憩
ko: 짧은 휴식

source: 确定要删除 %lld 条已完成的待办吗？此操作不可撤销。
en: Delete %lld completed todos? This cannot be undone.
ja: 完了した%lld件のToDoを削除しますか?この操作は取り消せません。
ko: 완료된 할 일 %lld개를 삭제하시겠어요? 취소할 수 없어요.
zh_hant: 確定要刪除 %lld 條已完成的待辦嗎？此操作不可撤銷。

source: 确定要退出该项目吗？
en: Are you sure you want to leave this project?
ja: このプロジェクトから退出しますか?
ko: 이 프로젝트에서 나가시겠어요?
zh_hant: 確定要退出該項目嗎？

source: 确认删除
en: Confirm Delete
ja: 削除の確認
ko: 삭제 확인
zh_hant: 確認刪除

source: 确认删除事件
en: Delete Event?
ja: イベントを削除しますか?
ko: 이벤트를 삭제할까요?
zh_hant: 確認刪除事件

source: 确认删除好友
en: Remove Friend?
ja: 友達を削除しますか?
ko: 친구를 삭제할까요?
zh_hant: 確認刪除好友

source: 确认删除已归档目标
en: Delete Archived Goal?
ja: アーカイブ済みの目標を削除しますか?
ko: 아카이브된 목표를 삭제할까요?
zh_hant: 確認刪除已歸檔目標

source: 确认删除此日历事件？此操作无法撤销。
en: Delete this calendar event? This action cannot be undone.
ja: このカレンダーイベントを削除しますか?この操作は取り消せません。
ko: 이 캘린더 이벤트를 삭제할까요? 취소할 수 없어요.
zh_hant: 確認刪除此日曆事件？此操作無法撤銷。

source: 确认删除该任务
en: Delete This Task?
ja: このタスクを削除しますか?
ko: 이 태스크를 삭제할까요?
zh_hant: 確認刪除該任務

source: 确认删除该待办？
en: Delete this todo?
ja: このToDoを削除しますか?
ko: 이 할 일을 삭제할까요?
zh_hant: 確認刪除該待辦？

source: 确认拒绝好友请求
en: Reject Friend Request?
ja: フレンドリクエストを拒否しますか?
ko: 친구 요청을 거절할까요?
zh_hant: 確認拒絕好友請求

source: 确认登出?
en: Sign Out?
ja: サインアウトしますか?
ko: 로그아웃할까요?
zh_hant: 確認登出？

source: 确认结束会议？
en: End this meeting?
ja: ミーティングを終了しますか?
ko: 미팅을 종료할까요?
zh_hant: 確認結束會議？

source: 确认退出项目
en: Leave Project?
ja: プロジェクトから退出しますか?
ko: 프로젝트에서 나갈까요?
zh_hant: 確認退出專案

source: 社交
en: Social
ja: ソーシャル
ko: 소셜

source: 社交 / 好友
en: Social / Friends
ja: ソーシャル / 友達
ko: 소셜 / 친구

source: 社交蝴蝶
en: Social Butterfly
ja: ソーシャルバタフライ
ko: 소셜 버터플라이

source: 社交达人
en: Social
ja: ソーシャル
ko: 소셜 마스터
zh_hant: 社交達人

source: 祝你新的一岁一切顺利！🎉
en: Wishing you a wonderful year ahead! 🎉
ja: 素敵な1年になりますように! 🎉
ko: 새로운 한 살이 모두 잘되길 바라요! 🎉
zh_hant: 祝你新的一歲一切順利！🎉

source: 离线数据
en: Offline Data
ja: オフラインデータ
ko: 오프라인 데이터
zh_hant: 離線數據

source: 移除
en: Remove
ja: 削除
ko: 제거

source: 稳步前行
en: Steady Progress
ja: 着実な進歩
ko: 꾸준한 진전
zh_hant: 穩步前行

source: 立即打卡
en: Check In Now
ja: 今すぐチェックイン
ko: 지금 체크인

source: 端到端加密
en: End-to-end encrypted
ja: エンドツーエンド暗号化
ko: 종단 간 암호화
zh_hant: 端對端加密

source: 第一轮复习 (考前 7 天)
en: 1st Review (7 days before)
ja: 第1回復習(試験7日前)
ko: 1차 복습(시험 7일 전)
zh_hant: 第一輪複習（考前 7 天）

source: 第二轮复习 (考前 3 天)
en: 2nd Review (3 days before)
ja: 第2回復習(試験3日前)
ko: 2차 복습(시험 3일 전)
zh_hant: 第二輪複習（考前 3 天）

source: 等宽
en: Monospace
ja: 等幅
ko: 고정폭
zh_hant: 等寬

source: 等待开始
en: Not Started
ja: 開始待ち
ko: 시작 대기
zh_hant: 等待開始

source: 等待成员加入...
en: Waiting for members...
ja: メンバーの参加を待機中...
ko: 멤버 참여 대기 중...
zh_hant: 等待成員加入...

source: 等待房主开始...
en: Waiting for host to start...
ja: ホストの開始を待機中...
ko: 호스트가 시작하기를 기다리는 중...
zh_hant: 等待房主開始...

source: 签证
en: Visa
ja: ビザ
ko: 비자
zh_hant: 簽證

source: 签证到期提醒
en: Visa Expiry Alerts
ja: ビザ期限アラート
ko: 비자 만료 알림
zh_hant: 簽證到期提醒

source: 类型
en: Type
ja: 種類
ko: 유형
zh_hant: 類型

source: 粘贴会议链接，队友可以一键加入
en: Paste a meeting link for teammates to join
ja: ミーティングリンクを貼り付けると、チームメンバーがワンタップで参加できます
ko: 미팅 링크를 붙여넣으면 팀원이 한 번에 참여할 수 있어요
zh_hant: 粘貼會議連結，隊友可以一鍵加入

source: 粘贴会议链接...
en: Paste meeting link...
ja: ミーティングリンクを貼り付け...
ko: 미팅 링크 붙여넣기...
zh_hant: 粘貼會議連結...

source: 粘贴导入
en: Paste Import
ja: 貼り付けインポート
ko: 붙여넣기 가져오기
zh_hant: 貼上匯入

source: 粘贴文本解析
en: Parse pasted text
ja: テキスト貼り付け解析
ko: 텍스트 붙여넣고 파싱
zh_hant: 貼上文字解析

source: 粘贴邮件 / 分享文本
en: Paste email / share text
ja: メール / 共有テキストを貼り付け
ko: 이메일 / 공유 텍스트 붙여넣기
zh_hant: 貼上郵件 / 分享文字

source: 粘贴邮件 / 携程分享内容
en: Paste email or Ctrip share
ja: メールやCtripの共有を貼り付け
ko: 이메일 또는 씨트립 공유 붙여넣기
zh_hant: 貼上郵件 / 攜程分享內容

source: 紧迫提醒开始时间
en: Urgency Window
ja: 緊急リマインダーウィンドウ
ko: 긴급 알림 윈도우
zh_hant: 緊迫提醒開始時間

source: 累计
en: Total
ja: 合計
ko: 누적
zh_hant: 累計

source: 累计 %lld 次
en: Total: %lld
ja: 合計: %lld
ko: 누적: %lld
zh_hant: 累計 %lld 次

source: 累计专注 %lld 小时解锁
en: Unlocked at %lld hours
ja: 合計%lld時間で解除
ko: 누적 %lld시간 집중 시 잠금 해제
zh_hant: 累計專注 %lld 小時解鎖

source: 累计小时
en: Total Hours
ja: 累計時間
ko: 누적 시간
zh_hant: 累計小時

source: 累计打卡 10 次
en: 10 total check-ins
ja: 累計チェックイン10回
ko: 누적 체크인 10회
zh_hant: 累計打卡 10 次

source: 累计打卡 50 次
en: 50 total check-ins
ja: 累計チェックイン50回
ko: 누적 체크인 50회
zh_hant: 累計打卡 50 次

source: 累计打卡 100 次
en: 100 total check-ins
ja: 累計チェックイン100回
ko: 누적 체크인 100회
zh_hant: 累計打卡 100 次

source: 组队专注
en: Group Focus
ja: グループフォーカス
ko: 그룹 집중
zh_hant: 組隊專注

source: 组队专注 Bonus
en: Group Focus Bonus
ja: グループフォーカスBonus
ko: 그룹 집중 Bonus
zh_hant: 組隊專注 Bonus

source: 组队专注完成!
en: Group Focus Complete!
ja: グループフォーカス完了!
ko: 그룹 집중 완료!
zh_hant: 組隊專注完成！

source: 终点时区
en: Arrival timezone
ja: 到着タイムゾーン
ko: 도착 시간대
zh_hant: 終點時區

source: 终点站
en: Arrival station
ja: 到着駅
ko: 도착역
zh_hant: 終點站

source: 经停 %lld 段
en: %lld stop(s)
ja: %lld区間経由
ko: %lld개 경유
zh_hant: 經停 %lld 段

source: 结束会议
en: End Meeting
ja: ミーティングを終了
ko: 미팅 종료
zh_hant: 結束會議

source: 结束后所有成员的位置共享将停止
en: All members' location sharing will stop
ja: 終了後、すべてのメンバーの位置共有が停止します
ko: 종료하면 모든 멤버의 위치 공유가 중단돼요
zh_hant: 結束後所有成員的位置共享將停止

source: 结束时间
en: End Time
ja: 終了時刻
ko: 종료 시간
zh_hant: 結束時間

source: 结束集合
en: End Meetup
ja: 集合を終了
ko: 모임 종료
zh_hant: 結束集合

source: 结束集合？
en: End meetup?
ja: 集合を終了しますか?
ko: 모임을 종료할까요?
zh_hant: 結束集合？

source: 继续
en: Resume
ja: 再開
ko: 계속
zh_hant: 繼續

source: 继续编辑
en: Continue Editing
ja: 編集を続ける
ko: 계속 편집
zh_hant: 繼續編輯

source: 编辑事件
en: Edit Event
ja: イベントを編集
ko: 이벤트 편집
zh_hant: 編輯事件

source: 编辑任务
en: Edit Task
ja: タスクを編集
ko: 태스크 편집
zh_hant: 編輯任務

source: 编辑分数
en: Edit Score
ja: スコアを編集
ko: 점수 편집
zh_hant: 編輯分數

source: 编辑待办
en: Edit Todo
ja: ToDoを編集
ko: 할 일 편집
zh_hant: 編輯待辦

source: 编辑日历事件
en: Edit Calendar Event
ja: カレンダーイベントを編集
ko: 캘린더 이벤트 편집
zh_hant: 編輯日曆事件

source: 编辑课程
en: Edit Course
ja: 科目を編集
ko: 과목 편집
zh_hant: 編輯課程

source: 编辑资料
en: Edit Profile
ja: プロフィールを編集
ko: 프로필 편집
zh_hant: 編輯資料

source: 编辑集合
en: Edit Meetup
ja: 集合を編集
ko: 모임 편집
zh_hant: 編輯集合

source: 网络请求失败
en: Network request failed
ja: ネットワークリクエストに失敗しました
ko: 네트워크 요청 실패
zh_hant: 網路請求失敗

source: 网络请求失败 (%lld)
en: Network request failed (%lld)
ja: ネットワークリクエスト失敗 (%lld)
ko: 네트워크 요청 실패 (%lld)
zh_hant: 網路請求失敗 (%lld)

# 网络请求失败 (%lld)：%@
source: 网络请求失败 (%1$lld)：%2$@
en: Network request failed (%lld): %@
ja: ネットワーク要求失敗 (%lld): %@
ko: 네트워크 요청 실패 (%lld): %@
zh_hant: 網路請求失敗 (%lld)：%@

source: 网络请求超时，请检查网络后重试
en: Network request timed out — check your connection and try again.
ja: ネットワーク要求がタイムアウトしました — 接続を確認してもう一度お試しください。
ko: 네트워크 요청 시간이 초과되었습니다 — 연결을 확인하고 다시 시도해 주세요.
zh_hant: 網路請求逾時，請檢查網路後重試

source: 网页查看用量
en: View usage on web
ja: Webで使用量を表示
ko: 웹에서 사용량 보기
zh_hant: 網頁查看用量

source: 置顶
en: Pin
ja: ピン留め
ko: 고정
zh_hant: 置頂

source: 置顶显示
en: Pin to Top
ja: トップに固定
ko: 상단 고정
zh_hant: 置頂顯示

source: 考试
en: Exam
ja: 試験
ko: 시험
zh_hant: 考試

source: 考试、签证、回国机票、截止日期——一眼看清还剩多少天。
en: Exams, visas, flights home, deadlines — see at a glance how many days are left.
ja: 試験、ビザ、帰国便、締切 — 残り日数が一目でわかります。
ko: 시험, 비자, 귀국 항공권, 마감일 — 남은 일수를 한눈에 확인하세요.
zh_hant: 考試、簽證、回國機票、截止日期——一眼看清還剩多少天。

source: 考试倒计时
en: Exam Countdown
ja: 試験カウントダウン
ko: 시험 카운트다운
zh_hant: 考試倒數

source: 联系我们
en: Contact Us
ja: お問い合わせ
ko: 문의하기
zh_hant: 聯繫我們

source: 背景图片
en: Background Image
ja: 背景画像
ko: 배경 이미지
zh_hant: 背景圖片

source: 自习室
en: Study Room
ja: スタディルーム
ko: 스터디룸
zh_hant: 自習室

source: 自习室暂时没有人 开始专注后加入吧!
en: No one in the study room yet. Start focusing to join!
ja: スタディルームはまだ誰もいません。 フォーカスを始めて参加しましょう!
ko: 스터디룸에 아직 아무도 없어요. 집중을 시작해서 참여하세요!
zh_hant: 自習室暫時沒有人 開始專注後加入吧！

source: 自动计算所有成员都空闲的时段
en: Automatically find times when all members are free
ja: 全メンバーが空いている時間を自動で探します
ko: 모든 멤버가 비어있는 시간대를 자동 계산
zh_hant: 自動計算所有成員都空閒的時段

source: 自动识别日历中的行程
en: Auto-detect travel in your calendar
ja: カレンダーから行程を自動検出
ko: 캘린더의 행정을 자동 감지
zh_hant: 自動識別日曆中的行程

source: 自动追踪用量
en: Auto-track usage
ja: 使用量を自動追跡
ko: 사용량 자동 추적
zh_hant: 自動追蹤用量

source: 自定义
en: Custom
ja: カスタム
ko: 사용자 지정
zh_hant: 自訂

source: 自定义 App Icon
en: Custom App Icon
ja: カスタムアプリアイコン
ko: 앱 아이콘 사용자 지정
zh_hant: 自訂 App 圖示

source: 自定义哪些标签显示在底部标签栏，其余收纳在「更多」中。
en: Choose which tabs appear in the bottom tab bar. The rest will be in "More".
ja: 下部のタブバーに表示するタブを選択してください。その他は「その他」に収納されます。
ko: 하단 탭바에 표시할 탭을 선택하세요. 나머지는 '더보기'에 들어가요.
zh_hant: 自訂哪些標籤顯示在底部標籤列，其餘收納在「更多」中。

source: 至少需要 2 人才能开始
en: At least 2 members needed to start
ja: 開始には最低2人必要です
ko: 최소 2명이 있어야 시작할 수 있어요
zh_hant: 至少需要 2 人才能開始

source: 致谢
en: Acknowledgements
ja: 謝辞
ko: 감사의 말
zh_hant: 致謝

source: 航司代码 / 车次前缀
en: Carrier / Train prefix
ja: 航空会社 / 列車接頭
ko: 항공사 / 열차 접두어
zh_hant: 航司代碼 / 車次前綴

source: 航班
en: Flight
ja: フライト
ko: 항공편

source: 航班号 (如 CA981)
en: Flight number (e.g. CA981)
ja: 航空便番号 (例: CA981)
ko: 항공편 번호 (예: CA981)
zh_hant: 航班號 (如 CA981)

source: 航班号查询
en: Flight lookup
ja: 航空便検索
ko: 항공편 조회
zh_hant: 航班號查詢

source: 航班号格式不对，应类似 CA981
en: Flight number format is invalid — expected like CA981
ja: 航空便番号の形式が正しくありません (例: CA981)
ko: 항공편 번호 형식이 올바르지 않아요. 예: CA981
zh_hant: 航班號格式不對，應類似 CA981

source: 获取用量失败，请稍后重试
en: Failed to fetch usage. Please try again later.
ja: 使用量の取得に失敗しました。しばらくしてから再試行してください
ko: 사용량 가져오기 실패, 잠시 후 다시 시도해주세요
zh_hant: 獲取用量失敗，請稍後重試

source: 获得的徽章
en: Badges
ja: バッジ
ko: 획득한 배지
zh_hant: 獲得的徽章

source: 菱形
en: Diamond
ja: ダイヤモンド
ko: 다이아몬드

source: 行程
en: Trips
ko: 행정

source: 行程中
en: En route
ja: 移動中
ko: 이동 중

source: 衬线
en: Serif
ja: セリフ
ko: 세리프
zh_hant: 襯線

source: 装饰品图鉴
en: Decoration Catalog
ja: 装飾カタログ
ko: 장식품 카탈로그
zh_hant: 裝飾品圖鑑

source: 解析
en: Parse
ko: 파싱

source: 解析 PDF 电子票
en: Parse PDF e-tickets
ja: PDF電子チケットを解析
ko: PDF 전자티켓 파싱
zh_hant: 解析 PDF 電子票

source: 解析失败
en: Parse failed
ja: 解析失敗
ko: 파싱 실패
zh_hant: 解析失敗

source: 解锁 StudySync Pro
en: Unlock StudySync Pro
ja: StudySync Proをアンロック
ko: StudySync Pro 잠금 해제
zh_hant: 解鎖 StudySync Pro

source: 解锁新装饰!
en: New Decoration Unlocked!
ja: 新しい装飾をアンロック!
ko: 새 장식품 잠금 해제!
zh_hant: 解鎖新裝飾！

source: 解锁无限倒计时、签证提醒等功能
en: Unlock unlimited countdowns, visa reminders & more
ja: 無制限のカウントダウン、ビザリマインダーなどをアンロック
ko: 무제한 카운트다운, 비자 알림 등의 기능을 잠금 해제
zh_hant: 解鎖無限倒數、簽證提醒等功能

source: 订票号
en: Booking #
ja: 予約番号
ko: 예약번호
zh_hant: 訂票號

source: 订票号 / PNR
en: Booking # / PNR
ja: 予約番号 / PNR
ko: 예약번호 / PNR
zh_hant: 訂票號 / PNR

source: 订阅信息
en: Subscription
ja: サブスクリプション
ko: 구독 정보
zh_hant: 訂閱資訊

source: 设为 Final
en: Set as Final
ja: Finalに設定
ko: Final로 설정
zh_hant: 設為 Final

source: 设定地点和时间，成员可查看模糊位置与到达时间
en: Set a place and time, members can see approximate locations and ETAs
ja: 場所と時間を設定すると、メンバーは大まかな位置と到着時刻を確認できます
ko: 장소와 시간을 설정하면 멤버가 대략적인 위치와 도착 시간을 볼 수 있어요
zh_hant: 設定地點和時間，成員可查看模糊位置與到達時間

source: 设置
en: Settings
ja: 設定
ko: 설정
zh_hant: 設定

source: 设置学习目标，每天打卡记录 见证自己的成长与坚持
en: Set study goals, check in daily Witness your growth and persistence
ja: 学習目標を設定し、毎日チェックインして 自分の成長と努力を記録
ko: 학습 목표를 설정하고 매일 체크인해서 성장과 꾸준함을 기록하세요
zh_hant: 設置學習目標，每天打卡記錄 見證自己的成長與堅持

source: 该出发前往机场了
en: Time to head to the airport
ja: 空港へ出発する時間です
ko: 공항으로 출발할 시간이에요
zh_hant: 該出發前往機場了

source: 该好友还没有开启 Due 共享功能
en: This friend hasn't enabled due sharing yet
ja: この友達はまだDue共有を有効にしていません
ko: 이 친구는 아직 Due 공유를 활성화하지 않았어요
zh_hant: 該好友還沒有開啟 Due 共享功能

source: 该服务暂不支持自动获取用量数据， 请在网页中查看。
en: This service does not support auto-fetching usage data yet. Please check on the web.
ja: このサービスは使用量の自動取得にまだ対応していません。 Webでご確認ください。
ko: 이 서비스는 아직 사용량 자동 가져오기를 지원하지 않아요. 웹에서 확인해주세요.
zh_hant: 該服務暫不支援自動獲取用量資料， 請在網頁中查看。

source: 该用户尚未设置时间轴
en: This user hasn't set up their timeline yet
ja: このユーザーはまだタイムラインを設定していません
ko: 이 사용자는 아직 타임라인을 설정하지 않았어요
zh_hant: 該用戶尚未設置時間軸

source: 该目标的所有打卡记录将被永久删除，无法恢复
en: All check-in records for this goal will be permanently deleted and cannot be recovered.
ja: この目標のすべてのチェックイン記録が完全に削除され、復元できません。
ko: 이 목표의 모든 체크인 기록이 영구 삭제되며 복구할 수 없어요.
zh_hant: 該目標的所有打卡記錄將被永久刪除，無法恢復

source: 请先登录
en: Please sign in first
ja: まずサインインしてください
ko: 먼저 로그인해주세요
zh_hant: 請先登入

source: 请在系统设置中允许 StudySync 写入日历事件。
en: Please allow StudySync to write calendar events in System Settings.
ja: システム設定でStudySyncがカレンダーイベントを書き込めるよう許可してください。
ko: 시스템 설정에서 StudySync의 캘린더 이벤트 쓰기를 허용해주세요.
zh_hant: 請在系統設定中允許 StudySync 寫入日曆事件。

source: 请在系统设置中允许 StudySync 访问你的日历。
en: Please allow StudySync to access your calendar in System Settings.
ja: システム設定でStudySyncがカレンダーにアクセスできるよう許可してください。
ko: 시스템 설정에서 StudySync의 캘린더 접근을 허용해주세요.
zh_hant: 請在系統設定中允許 StudySync 存取你的日曆。

source: 请在设置中允许访问相册
en: Please allow photo access in Settings
ja: 設定で写真へのアクセスを許可してください
ko: 설정에서 사진 접근을 허용해주세요
zh_hant: 請在設定中允許存取相簿

source: 请按以下步骤把登机牌发给 StudySync
en: Follow these steps to send your boarding pass to StudySync
ja: 以下の手順で搭乗券を StudySync に送信してください
ko: 다음 단계에 따라 탑승권을 StudySync로 보내세요
zh_hant: 請依下列步驟把登機證傳給 StudySync

source: 请求构造失败
en: Failed to build request
ja: リクエストの作成に失敗しました
ko: 요청 구성 실패
zh_hant: 請求建構失敗

source: 请输入邮箱地址
en: Please enter an email address
ja: メールアドレスを入力してください
ko: 이메일 주소를 입력해주세요
zh_hant: 請輸入電子郵件地址

source: 读取 Wallet 登机牌
en: Read Wallet boarding passes
ja: Walletの搭乗券を読み取る
ko: Wallet 탑승권 읽기
zh_hant: 讀取 Wallet 登機牌

source: 读取失败：%@
en: Read failed: %@
ja: 読み込み失敗: %@
ko: 읽기 실패: %@
zh_hant: 讀取失敗：%@

source: 课程
en: Course
ja: 科目
ko: 과목
zh_hant: 課程

source: 课程 (可选)
en: Course (optional)
ja: 科目(オプション)
ko: 과목 (선택)
zh_hant: 課程（可選）

source: 课程名称
en: Course Name
ja: 科目名
ko: 과목 이름
zh_hant: 課程名稱

source: 调整底部导航栏显示的标签数量，其余标签收纳在「更多」页面中。
en: Adjust the number of tabs shown in the bottom navigation bar. Extra tabs appear in "More".
ja: 下部ナビゲーションバーに表示するタブ数を調整。その他は「その他」ページに収納されます。
ko: 하단 내비게이션 바에 표시할 탭 수를 조정하세요. 나머지는 '더보기' 페이지에 들어가요.
zh_hant: 調整底部導航列顯示的標籤數量，其餘標籤收納在「更多」頁面中。

source: 贡献者
en: Contributor
ja: 貢献者
ko: 기여자
zh_hant: 貢獻者

source: 账户信息
en: Account Info
ja: アカウント情報
ko: 계정 정보
zh_hant: 帳戶資訊

source: 账户已删除
en: Account deleted
ja: アカウントを削除しました
ko: 계정이 삭제되었어요
zh_hant: 帳戶已刪除

source: 货币对
en: Currency Pairs
ja: 通貨ペア
ko: 통화 쌍
zh_hant: 貨幣對

source: 购买失败: %@
en: Purchase failed: %@
ja: 購入失敗: %@
ko: 구매 실패: %@
zh_hant: 購買失敗：%@

source: 购买待处理
en: Purchase pending
ja: 購入処理中
ko: 구매 대기 중
zh_hant: 購買待處理

source: 购买成功!
en: Purchase Successful!
ja: 購入成功!
ko: 구매 성공!
zh_hant: 購買成功！

source: 购买验证失败
en: Purchase verification failed
ja: 購入確認に失敗しました
ko: 구매 확인 실패
zh_hant: 購買驗證失敗

source: 资料已保存
en: Profile saved
ja: プロフィールを保存しました
ko: 프로필이 저장됐어요
zh_hant: 資料已儲存

source: 起步之星
en: Rising Star
ja: ライジングスター
ko: 라이징 스타

source: 起点时区
en: Departure timezone
ja: 出発タイムゾーン
ko: 출발 시간대
zh_hant: 起點時區

source: 起点站
en: Departure station
ja: 出発駅
ko: 출발역
zh_hant: 起點站

source: 起飞 / 发车时间
en: Departure time
ja: 出発時刻
ko: 출발 시간
zh_hant: 起飛 / 發車時間

source: 起飞日期
en: Flight date
ja: 出発日
ko: 출발 날짜
zh_hant: 起飛日期

source: 超时自动结束
en: Auto-end Timeout
ja: タイムアウト自動終了
ko: 타임아웃 자동 종료
zh_hant: 超時自動結束

# 距离 %@ 还有 %lld 天
source: 距离 %1$@ 还有 %2$lld 天
en: '%1$@' is in %2$lld days
ja: '%1$@'まであと%2$lld日
ko: '%1$@'까지 %2$lld일 남았어요
zh_hant: 距離 %1$@ 還有 %2$lld 天

source: 距离结束还有 %lld 分钟
en: Ends in %lld minutes
ja: 終了まであと%lld分
ko: 종료까지 %lld분 남음
zh_hant: 距離結束還有 %lld 分鐘

# 距离结束还有 %lld 小时 %lld 分钟
source: 距离结束还有 %1$lld 小时 %2$lld 分钟
en: Ends in %lld hours %lld minutes
ja: 終了まであと%lld時間%lld分
ko: 종료까지 %lld시간 %lld분 남음
zh_hant: 距離結束還有 %lld 小時 %lld 分鐘

source: 跳过
en: Skip
ja: スキップ
ko: 건너뛰기
zh_hant: 跳過

source: 车次 / 航班号
en: Train / Flight #
ja: 列車 / 航空便番号
ko: 열차 / 항공편 번호
zh_hant: 車次 / 航班號

source: 车次查询
en: Train lookup
ja: 列車検索
ko: 열차 조회
zh_hant: 車次查詢

source: 轮渡
en: Ferry
ja: フェリー
ko: 페리
zh_hant: 輪渡

source: 轮渡提醒
en: Ferry reminders
ja: フェリーリマインダー
ko: 페리 알림
zh_hant: 輪渡提醒

source: 较上周
en: vs Last Week
ja: 先週比
ko: 지난주 대비
zh_hant: 較上週

source: 输入 API Key
en: Enter API Key
ja: APIキーを入力
ko: API 키 입력
zh_hant: 輸入 API Key

source: 输入你的邮箱，我们会发送一封重置密码的邮件
en: Enter your email and we'll send you a password reset link
ja: メールアドレスを入力してください。パスワードリセットリンクをお送りします
ko: 이메일을 입력하시면 비밀번호 재설정 링크를 보내드려요
zh_hant: 輸入你的電子郵件，我們會寄送一封重設密碼的郵件
